export class Recipes{
    recipes:any=[
        {
            id:1,
            url:'/assets/images/paneer-butter-masala.jpg',
            title:'Panner Butter Masala',
            detail: 'पनीर बटर मसाला बनाने की विधि | पनीर मखनी | बटर पनीर नुस्खा विस्तृत फोटो और वीडियो नुस्खा के साथ। यह एक लोकप्रिय और समृध्द मलाईदार कॉटेज पनीर के साथ बनानेवाला उत्तर भारतीय या पंजाबी करी है। यह रेसिपी प्रसिद्ध बटर चिकन का एक शाकाहारी विकल्प है जहां पनीर को चिकन क्यूब्स के बदले उपयोग किया जाता है। यह एक प्रीमियम करी है जिसे आदर्श रूप से भारतीय फ्लैटब्रेड या यहां तक ​​कि जीरा राइस और घी राइस जैसे चावल के व्यंजनों के साथ परोसा जाता है।'
        },
        {
            id: 2,
            url: '/assets/images/Dum-Aloo.jpg',
            title: 'Dum Alloo',
            detail: 'सुनहरा होने पर आंच बंद कर इसे निकाल लें । हरी मिर्च,औरअदरक मिलाकर अच्छे से पीस लें। तेल गरम करें, तेल के गरम होते ही इसमें जीरा, डालिये। जीरे के भुनते ही तैयार पेस्ट को डालकर ग्रेवी तैयार करें। पेस्ट जैसे ही तेल छोड़ने लगे हल्दी, जीरा पाउडर, लाल मिर्च पाउडर, धनिया पाउडरऔर नमक डालकर अच्छे से मिक्स करें। क्रीम डालिऐ, बटर डलिऐ। एक उबाल आते ही फ्राइड आलू डालकर ढककर लगभग 5 मिनट तक पकाएं। ग्रेवी के गाढ़ा होते ही कसूरी मेथी डालकर मिक्स करें और आंच बंद कर दें।'
        },
        {
            id: 3,
            url: '/assets/images/chicken-curry.jpg',
            title: 'Chicken-Curry',
            detail: 'चिकन करी बनाने के लिए सबसे पहले एक कड़ाही में तेल गर्म होने पर उसमें चिकन और दही डाल दें। इसके बाद कड़ाही में हल्दी, नमक डालें।आप चिकन को तब तक फ्राई करें जब तक दही पूरी तरह से ड्राई न हो जाए। अब एक अलग पेन में तेल गर्म होने के लिए रख दें। तेल गर्म होने पर उसमें खड़ा मसाला, प्याज, अदरक, लहसुन का पेस्ट और टमाटर प्यूरी डालकर पका लें। अब पेन में लाल मिर्च, हल्दी, धनिया पाउडर डालें। अब मसालों को तब तक पकाते रहें जब तक तेल ऊपर न दिखाई देने लगे। मसालों को अच्छी तरह पकाने के बाद आप इसमें पहले से फ्राई किया हुआ चिकन डाल दें। अब चिकन को मसालों के साथ अच्छे से मिलाते हुए पेन में 1 कप गुनगुना पानी डाल दें। आपकी चिकन करी तैयार है। इसे हरी धनिया पत्ती से गार्निश करने के बाद मेहमानों को सर्व करें।'
        },
        {
            id: 4,
            url: '/assets/images/carrot_biryani.jpg',
            title: 'Carrot Biryani',
            detail: 'गाजर पुलाव दक्षिण भारत की एक डिश है जिसे अकसर घरो में बनाया जाता है. इस पुलाव में सांबर पाउडर और इलाइची पाउडर का भी प्रयोग किया जाता है जो इसके स्वाद को और भी बढ़ाता है. आप इस पुलाव को अपने या अपने बच्चो के लंच बॉक्स में भी पैक कर सकते है. यह बनाने में आसान है और आप इसमें बचे हुए चावल का भी प्रयोग कर सकते है.गाजर पुलाव को पालक रायता, पनीर मसाला और फुल्के के साथ दिन के खाने के लिए परोसे। अगर आपको यह रेसिपी अच्छी लगी हो तो, आप यह भी बना सकते है '
        }
    ]
}